ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
redhat.vscode-yaml
redhat.vscode-xml
eamodio.gitlens
donjayamanne.githistory
mhutchie.git-graph
ms-azuretools.vscode-docker
tamasfe.even-better-toml
streetsidesoftware.code-spell-checker
usernamehw.errorlens
aaron-bond.better-comments
oderwat.indent-rainbow
formulahendry.code-runner
ms-vsliveshare.vsliveshare
yzhang.markdown-all-in-one
davidanson.vscode-markdownlint
shd101wyy.markdown-preview-enhanced
esbenp.prettier-vscode
dbaeumer.vscode-eslint
christian-kohler.path-intellisense
visualstudioexptteam.vscodeintellicode
github.copilot
